sims/83ml_water_above_shower/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/piston2_water_shower/piston_water-lower-region_shower.blend
// Export date: 2025-02-01 16:27:10.392952

convertToMeters 0.01;

vertices
(
    ( -3.9 -3.9 -6.1 )
    ( 3.9 -3.9 -6.1 )
    ( 3.9 3.9 -6.1 )
    ( -3.9 3.9 -6.1 )
    ( -3.9 -3.9 4.6 )
    ( 3.9 -3.9 4.6 ) 
    ( 3.9 3.9 4.6 ) 
    ( -3.9 3.9 4.6 ) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (78 78 107) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
