sims/83ml_water_above_shower/system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/piston2_water_shower/piston_water-lower-region_shower.blend
// Export date: 2025-02-01 16:27:10.393491

// Details about SnappyHexMesh parameters can be found in annotated caseDicts:
// - For openfoam.org (development version), see
//   https://github.com/OpenFOAM/OpenFOAM-dev/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// - For openfoam.com (development version), see
//   https://develop.openfoam.com/Development/openfoam/-/blob/master/etc/caseDicts/annotated/snappyHexMeshDict
// See also links in https://openfoamwiki.net/index.php/SnappyHexMesh

castellatedMesh true;
snap            true;
addLayers       false;

mergePatchFaces false;  // Avoid face merging to increase layer coverage

geometry
{
    piston
    {
        type triSurfaceMesh;
        file "piston.stl";
        // Min Bounds = [-3.80000e+00 -3.80000e+00 -6.00000e+00]
        // Max Bounds = [ 3.80000e+00  3.80000e+00  4.50000e+00]
        // Area = 3.64224e+02
    }
    water
    {
        type triSurfaceMesh;
        file "water.stl";
        // Min Bounds = [-2.07500e+00 -2.07500e+00 -5.25000e+00]
        // Max Bounds = [ 2.07500e+00  2.07500e+00  7.50000e-01]
        // Area = 1.04980e+02
    }
}

castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 4;
    locationInMesh (0.0 0.0 0.0);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    // useLeakClosure true; // OpenFOAM.com option
    handleSnapProblems true;
    useTopologicalSnapDetection true;

    features
    (
        {
            file "piston.eMesh";
            level 0;
        }
        {
            file "water.eMesh";
            level 0;
        }

    );

    refinementSurfaces
    {
        piston
        {
            level (0 0);
            patchInfo { type patch; }
            faceZone piston;
            faceType internal;
            cellZone piston;
            cellZoneInside inside;
        }
        water
        {
            level (0 0);
            patchInfo { type patch; }
            faceZone water;
            faceType internal;
            cellZone water;
            cellZoneInside inside;
        }

    }

    refinementRegions
    {

    }
}

snapControls
{
    nSmoothPatch 2;
    nSmoothInternal 1; // OpenFOAM.com option
    tolerance 2.0;
    nSolveIter 4;
    nRelaxIter 5;
    nFeatureSnapIter 3;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    nFaceSplitInterval -1; // OpenFOAM.com option
    releasePoints false;  // multi-region related option
    stringFeatures true;
    avoidDiagonal false;
    strictRegionSnap false;
    concaveAngle 45;
    minAreaRatio 0.3;
}

addLayersControls
{
    // Layer sizing
    relativeSizes true;
    expansionRatio 1.3;
    finalLayerThickness 0.6;
    minThickness 0.001;
    nGrow 0;

    // Mesh dependencies
    featureAngle 85;
    mergePatchFacesAngle 45; // OpenFOAM.com option
    layerTerminationAngle 45; // OpenFOAM.com option
    maxFaceThicknessRatio 0.5;
    disableWallEdges false;

    // Mesh displacement iterations
    nSmoothSurfaceNormals 8;
    nSmoothThickness 2;
    nSmoothNormals 0;
    nSmoothDisplacement 12;
    nMedialAxisIter 1000;

    // Medial axis analysis
    minMedianAxisAngle 90;
    maxThicknessToMedialRatio 0.5;
    slipFeatureAngle 30;
    nRelaxIter 10;

    // OpenFOAM.com displacement motion solver
    // meshShrinker displacementMotionSolver;
    // solver displacementLaplacian;
    // displacementLaplacianCoeffs { diffusivity quadratic inverseDistance ("wall.*"); }

    // Mesh shrinking overall settings
    nBufferCellsNoExtrude 0;
    nLayerIter 8;
    nRelaxedIter 0;
    nOuterIter 1000; // OpenFOAM.com option, 1=single pass layer addition
    additionalReporting true;

    layers
    {

    }
}

meshQualityControls
{
    nSmoothScale    4;
    errorReduction  0.75;
    #include "meshQualityDict"
}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;
