sims/83ml_water_above_shower/0/water/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/water";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 373;

boundaryField
{
    water_to_piston
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 373;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    water_to_surronding_air
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 373;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
