sims/83ml_water_above_shower/system/water/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         GaussSeidel;


        maxIter          100;
    }

    "(U|h|e|k|omega|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol         0;
    }

    "(U|h|e|k|omega|epsilon)Final"
    {
        $U;
        relTol          0;
    }
    
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

/*
solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;

        smoother         GaussSeidel;

    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|h|k|e|T|epsilon|R)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|h|k|e|T|epsilon|R)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
}
*/

/*
PIMPLE
{
    //momentumPredictor   yes;
    momentumPredictor false;
    nOuterCorrectors 40;
    nCorrectors     3;
    consistent      true;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    
    //residualControl
    //{
    //    p_rgh
    //    {
    //        tolerance 1e-3;
    //        relTol 0;
    //    }
    //}
    
}
*/

/*
relaxationFactors
{
    equations
    {
        "h.*"           1;
        "U.*"           1;
    }
}
*/

// ************************************************************************* //
