sims/83ml_water_above_shower/system/createBafflesDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/piston2_water_shower/piston_water-lower-region_shower.blend
// Export date: 2025-02-01 16:27:10.393129

internalFacesOnly true;

baffles
{
    piston
    {
        type faceZone;
        zoneName piston;

        patches
        {
            owner
            {
                name piston;
                type patch;
            }

            neighbour
            {
                name piston_2;
                type patch;
            }
        }
    }

    water
    {
        type faceZone;
        zoneName water;

        patches
        {
            owner
            {
                name water;
                type patch;
            }

            neighbour
            {
                name water_2;
                type patch;
            }
        }
    }


}
