sims/83ml_water_above_shower/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/piston2_water_shower/piston_water-lower-region_shower.blend
// Export date: 2025-02-01 16:27:10.393106

numberOfSubdomains 1;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
