sims/83ml_water_above_shower/system/meshQualityDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/piston2_water_shower/piston_water-lower-region_shower.blend
// Export date: 2025-02-01 16:27:10.393170

maxNonOrtho     35;
maxBoundarySkewness 2.0;
maxInternalSkewness 1.5;
maxConcave      30;
minVol          1e-15;
minTetQuality   1e-15;
minArea         1e-30;
minTwist        0.05;
minDeterminant  0.001;
minFaceWeight   0.05;
minVolRatio     0.05;
minTriangleTwist 0.6;

// Relaxed quality criteria for layer addition phase

relaxed {
    maxNonOrtho 65;
}
