sims/83ml_water_above_shower/system/piston/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
energySource
{
    type            scalarSemiImplicitSource;
    active          true;


    scalarSemiImplicitSourceCoeffs
    {   
        selectionMode   all;
        volumeMode      absolute;//specific;//
        injectionRateSuSp
        {
            h           (0 0); //   q in [W]; or in [W/m³] if you use specific mode
        }     
    }
}
*/

/*
energySource
{
    type            semiImplicitSource;
    select          all;
    volumeMode      absolute;

    sources
    {
        h
        {
            implicit 0;
        }
    }
}
*/

// ************************************************************************* //
