sims/83ml_water_above_shower/system/surfaceFeaturesDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeaturesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.8
// Source file: /home/da/piston2_water_shower/piston_water-lower-region_shower.blend
// Export date: 2025-02-01 16:27:10.392895



surfaces
(
    "piston.stl"
    "water.stl"
);

includedAngle 150;
writeObj yes;


